{
    "methods": [
        {
            "name": "Словесные методы",
            "listing": [
                {
                    "name": "Рассказ",
                    "description": "Устное образное, последовательное изложение небольшого по объему материала. Продолжительность рассказа по времени 20 – 30 минут. Метод изложения учебного материала отличается от объяснения тем, что он носит повествовательный характер и применяется при сообщении студентами фактов, примеров, описании событий, явлений, опыта работы предприятий, при характеристике литературных героев, исторических деятелей, ученых и т. д. Рассказ может сочетаться с другими методами: объяснением, беседой, упражнениями. Часто рассказ сопровождается демонстрацией наглядных пособий, опытов, диафильмов и кинофрагментов, фотодокументов."
                },
                {
                    "name": "Объяснение",
                    "description": "Под объяснением следует понимать словесное истолкование закономерностей, существенных свойств изучаемого объекта, отдельных понятий, явлений. Объяснение – это монологическая форма изложения. Объяснение характеризуется тем, что оно носит доказательный характер и направлено на выявление существенных сторон предметов и явлений, характера и последовательности событий, на раскрытие сущности отдельных понятий, правил, законов. Объясняя, преподаватель отвечает на вопросы: «Что это такое?», «Почему?». При объяснении должны хорошо использоваться различные средства наглядности, которые способствуют вскрытию существенных сторон, изучаемых тем, положений, процессов, явлений и событий."
                },
                {
                    "name": "Беседа",
                    "description": "Диалогический метод обучения, при котором преподаватель путем постановки тщательно продуманной системы вопросов подводит студентов к пониманию нового материала или проверяет усвоение уже изученного. Беседа относится к наиболее распространенным методам дидактической работы. Преподаватель, опираясь на знания и опыт студентов, последовательной постановкой вопросов подводит их к пониманию и усвоению новых знаний. Вопросы ставятся перед всей группой, и после небольшой паузы (8–10 секунд) называется фамилия студента. Это имеет большое психологическое значение – вся группа готовится к ответу. Если студент затрудняется ответить, не следует «вытягивать» из него ответ – лучше вызвать другого."
                },
                {
                    "name": "Дискуссия",
                    "description": "Дискуссия как метод обучения основан на обмене взглядами по определенной проблеме, причем эти взгляды отражают собственное мнение участников или опираются на мнение других лиц. Этот метод целесообразно использовать в том случае, когда студенты обладают значительной степенью зрелости и самостоятельностью мышления, умеют аргументировать, доказывать и обосновывать свою точку зрения. Хорошо проведенная дискуссия имеет обучающую и воспитательную ценность: учит более глубокому пониманию проблемы, умению защищать свою позицию, считаться с мнением других. Работа с учебником и книгой - важнейший метод обучения. Работа с книгой осуществляется главным образом на уроках под руководством преподавателя или самостоятельно."
                },
                {
                    "name": "Семинар",
                    "description": "Один из эффективных методов проведения занятий. Проведению семинарских занятий обычно предшествуют лекции, которые определяют тему, характер и содержание семинара. Семинарские занятия обеспечивают: 1) решение, углубление, закрепление знаний, полученных на лекции и в результате самостоятельной работы; 2) формирование и развитие навыков творческого подхода к овладению знаниями и самостоятельному изложению их перед аудиторией; 3) развитие активности студентов в обсуждении вопросов и проблем, поставленных на обсуждение семинарского занятия; 4) семинарам присуща также функция контроля знаний."
                },
                {
                    "name": "Экскурсия",
                    "description": "Один из методов приобретения знаний, является составной частью учебного процесса. Учебно-познавательные экскурсии могут быть обзорно-ознакомительные, тематические и проводятся они, как правило, коллективно под руководством преподавателя или специалиста-экскурсовода. Экскурсии — довольно эффективный метод обучения. Они способствуют наблюдательности, накоплению сведений, формированию визуальных впечатлений."
                }
            ]
        },
        {
            "name": "Наглядные методы обучения",
            "listing": [
                {
                    "name": "Метод иллюстраций",
                    "description": "Предполагает показ студентам иллюстрированных пособий: плакатов, таблиц, картин, зарисовок на доске и т.д."
                },
                {
                    "name": "Метод демонстраций",
                    "description": "Обычно связан с демонстрацией приборов, опытов, технических установок, кинофильмов, диафильмов и др."
                },
                {
                    "name": "Наблюдения",
                    "description": "Смысл метода наблюдения состоит в непосредственном и опосредованном восприятии изучаемых педагогических процессов наблюдателем. При всех своих возможностях методы наблюдения имеют один недостаток: при наблюдении полно раскрываются лишь внешние проявления, внутренние процессы остаются недоступны. Существуют непосредственные и опосредованные методы наблюдения. При непосредственном наблюдении исследователь может просматривать весь ход событий, выстраивая их в логическую цепочку и анализируя. Гораздо сложнее происходит процесс опосредованного наблюдения, так как при этом наблюдаемый процесс скрыт и лишь потом восстанавливается по каким-либо показателям."
                }
            ]
        },
        {
            "name": "Методы практического обучения",
            "listing": [
                {
                    "name": "Упражнения",
                    "description": "Под упражнениями понимают повторное (многократное) выполнение умственного или практического действия с целью овладения или повышения его качества. Упражнения применяются при изучении всех предметов и на различных этапах учебного процесса. Характер и методика упражнений зависит от особенностей учебного предмета, конкретного материала, изучаемого вопроса и возраста студентов. Упражнения по своему характеру подразделяются на устные, письменные, графические и учебно-трудовые."
                },
                {
                    "name": "Творческие работы",
                    "description": "Выполнение творческих работ является важным средством развития творческих способностей студентов, формирования навыков целенаправленной самостоятельной работы, расширения и углубления знаний, умения использовать их при выполнении конкретных задач. К творческим работам студентов относятся: написание рефератов, сочинений, рецензий, разработка курсовых и дипломных проектов, выполнение рисунков, эскизов и различного рода других творческих заданий."
                },
                {
                    "name": "Лабораторные работы",
                    "description": "Это проведение студентами по заданию преподавателя опытов с использованием приборов, применением инструментов и других технических приспособлений, т. е. это изучение студентами каких-либо явлений с помощью специального оборудования."
                },
                {
                    "name": "Практическое занятие",
                    "description": "Это основной вид учебных занятий, направленный на формирование учебных и профессиональных практических умений и навыков."
                },
                {
                    "name": "Методы тестирования",
                    "description": "Тестирование осуществляется по тщательно отработанным стандартизированным вопросам и задачам со шкалами их значений для выявления индивидуальных различий испытуемых. Существуют различные виды тестов: 1) тесты для выявления успеваемости учащихся; 2) тесты для определения профессиональной предрасположенности; 3) тесты для выявления уровня интеллекта; 4) тесты для выявления креативности и т.д."
                },
                {
                    "name": "Опросные методы",
                    "description": "Они просты в своем применении и позволяют с помощью минимальных временных затрат и несложной организации получить достаточно широкий спектр данных. В практике наиболее популярны три вида методов: 1) беседа; 2) интервьюирование; 3) анкетирование."
                },
                {
                    "name": "Эксперимент",
                    "description": "Педагогический эксперимент относят к основным методам исследований в педагогической науке. Педагогический эксперимент – это организованная педагогическая деятельность учителей и учащихся, имеющая определенную цель. По масштабу эксперименты бывают: 1) глобальные; 2) локальные. Глобальные охватывают значительное число испытуемых, а локальные проводятся с минимальным количеством участников."
                },
                {
                    "name": "Социологические методы",
                    "description": "Изучение школьной документации и продуктов деятельности учащихся. При попытке сделать педагогические обобщения и выводы, провести исследования необходимо изучение продуктов деятельности учащихся, а также школьной документации. Изучение классных журналов, ведомостей обучения позволяет сделать выводы об уровне успеваемости учащихся."
                }
            ]
        }
    ],
    "classification": [
        {
            "type": "text",
            "value": "В рамках перцептивного подхода Е.Я. Голант, Н.М. Верзилин, С.Г. Шаповаленко и другие по источнику передачи информации и характеру ее восприятия обучающимися выделили три группы методов обучения: словесные, наглядные и практические, которые представлены на рис.1."
        },
        {
            "type": "image",
            "value": "/assets/class1.png",
            "description": "Рис. 1. Классификация методов обучения по источнику передачи информации и характеру ее восприятия"
        },
        {
            "type": "text",
            "value": "В классификации методов обучения М.И. Махмутова по видам деятельности субъектов образовательного процесса выделены методы преподавания (англ. methods of instruction) и методы учения (англ. learning methods), показанные на рис.2."
        },
        {
            "type": "image",
            "value": "/assets/class2.png",
            "description": "Рис. 2. Классификация методов обучения по видам деятельности субъектов образовательного процесса"
        },
        {
            "type": "text",
            "value": "В классификации методов учебно-познавательной деятельности Ю.К. Бабанского выделено три группы методов, которые представлены на рис.3."
        },
        {
            "type": "image",
            "value": "/assets/class3.png",
            "description": "Рис. 3. Классификация методов учебно-познавательной деятельности Ю.К. Бабанского"
        },
        {
            "type": "text",
            "value": "В классификации методов учения по дидактическим целям и соответствующим им видам деятельности обучающихся, предложенной В.А. Онищуком, выделены коммуникативный, познавательный, преобразовательный, систематизирующий и контрольный методы (рис.4)."
        },
        {
            "type": "image",
            "value": "/assets/class4.gif",
            "description": "Рис. 4. Классификация методов обучения по дидактическим целям"
        },
        {
            "type": "text",
            "value": "В классификации, предложенной И.Я. Лернером и М.Н. Скаткиным, методы обучения проранжированы по возрастанию уровня активности и степени самостоятельности обучающихся в познавательной деятельности: от информационно-рецептивного к исследовательскому. На рис.5 представлены основные этапы деятельности педагога и обучающихся в ходе использования данных методов обучения."
        },
        {
            "type": "image",
            "value": "/assets/class5.jpg",
            "description": "Рис. 5. Классификация методов обучения И.Я. Лернера, М.Н. Скаткина"
        },
        {
            "type": "text",
            "value": "А.В.Хуторским разработана классификация методов продуктивного обучения (рис.6), в которой выделены три группы методов: когнитивные (методы познания окружающей действительности), креативные (методы создания внешних и внутренних образовательных продуктов) и оргдеятельностные (методы организации образовательного процесса)."
        },
        {
            "type": "image",
            "value": "/assets/class6.png",
            "description": "Рис. 6. Классификация Методов продуктивного обучения"
        },
        {
            "type": "text",
            "value": "В обобщенной классификации методов обучения, предложенной Г.К. Селевко (рис.7), в качестве отдельной группы выделены информационно-коммуникационные методы как способы организации процесса обучения, предъявления образовательного контента и управления познавательной деятельностью обучающихся с использованием современных информационно-коммуникационных технологий."
        },
        {
            "type": "image",
            "value": "/assets/class7.png",
            "description": "Рис. 7. Классификация методов обучения по Г.К. Селевко"
        }
    ],
    "receptions": {
        "d": {
            "name": "Приемы наглядных методов",
            "description": "Показ картин, картинки; показ игрушки; показ движения, действия; использование тсо (технических средств обучения)."
        },
        "s": {
            "name": "Приемы словесных методов",
            "types": [
                {
                    "name": "Виды вопросов",
                    "subtypes": [
                        "репродуктивные",
                        "поисковые",
                        "обобщающие",
                        "прямые",
                        "наводящие",
                        "подсказывающие"
                    ]
                },
                {
                    "name": "Речевой образец",
                    "subtypes": [
                        "повторение",
                        "объяснение",
                        "указания",
                        "словесные упражнения",
                        "оценка детской речи"
                    ]
                }
            ]
        },
        "t": {
            "name": "Приемы практических методов (носят игровой характер)",
            "types": [
                "дидактические игры (игры с предметами, настолько-печатные, словесные)",
                "игровые упражнения",
                "игры-занятия"
            ]
        }
    },
    "technologies": [
        {
            "name": "Информационно-коммуникационная технология",
            "description": "Применение ИКТ способствует достижению основной цели модернизации образования – улучшению качества обучения, обеспечению гармоничного развития личности, ориентирующейся в информационном пространстве, приобщенной к информационно-коммуникационным возможностям современных технологий и обладающей информационной культурой, а также представить имеющийся опыт и выявить его результативность."
        },
        {
            "name": "Технология развития критического мышления",
            "description": "Критическое мышление – тот тип мышления, который помогает критически относится к любым утверждениям, не принимать ничего на веру без доказательств, но быть при этом открытым новым идеям, методам. Критическое мышление – необходимое условие свободы выбора, качества прогноза, ответственности за собственные решения."
        },
        {
            "name": "Проектная технология",
            "description": "Проектная технология – это практические творческие задания, требующие от учащихся их применение для решения проблемных заданий, знания материала на данный исторический этап. Являясь исследовательским методом, она учит анализировать конкретную историческую проблему или задачу, создавшуюся на определенном этапе развития общества. Овладевая культурой проектирования, школьник приучается творчески мыслить, прогнозировать возможные варианты решения стоящих перед ним задач."
        },
        {
            "name": "Здоровьесберегающие технологии",
            "description": "Обеспечение школьнику возможности сохранения здоровья за период обучения в школе, формирование у него необходимых знаний, умений и навыков по здоровому образу жизни и применение полученных знаний в повседневной жизни."
        },
        {
            "name": "Технология проблемного обучения",
            "description": "Это такая система обучения, в которой преподаватель на занятии предлагает проблемную ситуацию, а учащиеся самостоятельно ее разрешают. Методика помогает творческому овладению знаниями и развитию мыслительных способностей. Технология проблемного обучения предполагает организацию под руководством педагога самостоятельной поисковой деятельности учащихся по решению учебных проблем, в ходе которых у учащихся формируются новые знания, умения и навыки, развиваются способности, познавательная активность, любознательность, эрудиция, творческое мышление и другие личностно значимые качества."
        },
        {
            "name": "Игровые технологии",
            "description": "Игра наряду с трудом и ученьем – один из основных видов деятельности человека, удивительный феномен нашего существования. Игра – это вид деятельности в условиях ситуаций, направленных на воссоздание и усвоение общественного опыта, в котором складывается и совершенствуется самоуправление поведением."
        },
        {
            "name": "Модульная технология",
            "description": "Модульное обучение возникло как альтернатива традиционному обучению. Связан с международным понятием ''модуль'', одно из значений которого – функциональный узел. В этом контексте он понимается как основное средство модульного обучения, законченный блок информации. Модульное обучение – альтернатива традиционного обучения, оно интегрирует все то прогрессивное, что накоплено в педагогической теории и практике. Модульное обучение, в качестве одной из основных целей, преследует формирование у обучающихся навыков самостоятельной деятельности и самообразования."
        },
        {
            "name": "Технология мастерских",
            "description": "Одним из альтернативных и эффективных способов изучения и добывания новых знаний, является технология мастерских. Она представляет собой альтернативу классно – урочной организации учебного процесса. В ней используется педагогика отношений, всестороннее воспитание, обучение без жёстких программ и учебников, метод проектов и методы погружения, безоценочная творческая деятельность учащихся. Актуальность технологии заключаются в том, что она может быть использована не только в случае изучения нового материала, но и при повторении и закреплении ранее изученного. Мастерская – это технология, которая предполагает такую организацию процесса обучения, при которой учитель – мастер вводит своих учеников в процесс познания через создание эмоциональной атмосферы, в которой ученик может проявить себя как творец. В этой технологии знания не даются, а выстраиваются самим учеником в паре или группе с опорой на свой личный опыт, учитель – мастер лишь предоставляет ему необходимый материал в виде заданий для размышления. Эта технология позволяет личности самой строить своё знание, в этом её большое сходство с проблемным обучением. Формируются коммуникативные качества личности, а также субъектность ученика – способность являться субъектом, активным участником деятельности, самостоятельно определять цели, планировать, осуществлять деятельность и анализировать."
        },
        {
            "name": "Кейс-технология",
            "description": "Кейс-технологии – это не повторение за учителем, не пересказ параграфа или статьи, не ответ на вопрос преподавателя, это анализ конкретной ситуации, который заставляет поднять пласт полученных знаний и применить их на практике. Кейсы отличаются от обычных образовательных задач (задачи имеют, как правило, одно решение и один правильный путь, приводящий к этому решению, кейсы имеют несколько решений и множество альтернативных путей, приводящих к нему). В кейс-технологии производится анализ реальной ситуации (каких-то вводных данных), описание которой одновременно отражает не только какую-либо практическую проблему, но и актуализирует определенный комплекс знаний, который необходимо усвоить при разрешении данной проблемы."
        },
        {
            "name": "Технология интегрированного обучения",
            "description": "Интеграция – это глубокое взаимопроникновение, слияние, насколько это возможно, в одном учебном материале обобщённых знаний в той или иной области. Интегрированные уроки развивают потенциал самих учащихся, побуждают к активному познанию окружающей действительности, к осмыслению и нахождению причинно-следственных связей, к развитию логики, мышления, коммуникативных способностей. Форма проведения интегрированных уроков нестандартна, интересна. Использование различных видов работы в течение урока поддерживает внимание учеников на высоком уровне, что позволяет говорить о достаточной эффективности уроков. Интегрированные уроки раскрывают значительные педагогические возможности."
        },
        {
            "name": "Педагогика сотрудничества",
            "description": "Это одна из наиболее эффективных технологий в преподавании разнообразных школьных дисциплин. Она относится к технологиям на основе личностной ориентации педагогического процесса. Такие технологии собой воплощение гуманистической философии, психологии и педагогики."
        },
        {
            "name": "Технологии уровневой дифференциации",
            "description": "Представляет собой совокупность организационных решений, средств и методов дифференцированного обучения, охватывающих определенную часть учебного процесса."
        },
        {
            "name": "Групповые технологии",
            "description": "Групповая работа на уроке – форма организации учебно-познавательной деятельности, предполагающая функционирование малых учебных групп, работающих как над общими, так и над специфическими заданиями педагога. Групповая работа на уроке стимулирует согласованное взаимодействие между учащимися, отношения взаимной ответственности и сотрудничества."
        },
        {
            "name": "Традиционные технологии (классно-урочная система)",
            "description": "Традиционная технология представляет собой прежде всего авторитарную педагогику требований, ученье весьма слабо связано с внутренней жизнью ученика, с его многообразными запросами и потребностями, отсутствуют условия для проявления индивидуальных способностей, творческих проявлений личности."
        }
    ]
}
